# overseer Brewfile — managed packages for all machines
# Run: overseer brew install

# Shell & CLI essentials
brew "git"
brew "gh"
brew "jq"
brew "fzf"
brew "ripgrep"
brew "tree"
brew "wget"
brew "htop"
brew "tmux"
brew "zsh"

# Security & secrets
brew "gnupg"
brew "1password-cli"

# Development
brew "go"
brew "node"
brew "python"
brew "direnv"
